runs/run_cht/cfd/rccs2d/0.orig/G
FoamFile { version 2.0; format ascii; class volScalarField; object G; }
dimensions [1 0 -3 0 0 0 0];
internalField uniform 0;
boundaryField
{
    plate
    {
        type MarshakRadiation;
        emissivityMode lookup;
        value uniform 0;
    }
    riser
    {
        type MarshakRadiation;
        emissivityMode lookup;
        value uniform 0;
    }
    topAndBottom
    {
        type MarshakRadiation;
        emissivityMode lookup;
        value uniform 0;
    }
    frontAndBack
    {
        type empty;
    }
}
