runs/run_cht/cfd/rccs2d/0.orig/alphat
FoamFile { version 2.0; format ascii; class volScalarField; object alphat; }
dimensions [1 -1 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    plate
    {
        type compressible::alphatWallFunction;
        Prt 0.85;
        value uniform 0;
    }
    riser
    {
        type compressible::alphatWallFunction;
        Prt 0.85;
        value uniform 0;
    }
    topAndBottom
    {
        type compressible::alphatWallFunction;
        Prt 0.85;
        value uniform 0;
    }
    frontAndBack
    {
        type empty;
    }
}
