runs/run_cht/cfd/rccs2d/0.orig/p_rgh
FoamFile { version 2.0; format ascii; class volScalarField; object p_rgh; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 1e5;
boundaryField
{
    plate
    {
        type fixedFluxPressure;
        value uniform 1e5;
    }
    riser
    {
        type fixedFluxPressure;
        value uniform 1e5;
    }
    topAndBottom
    {
        type fixedFluxPressure;
        value uniform 1e5;
    }
    frontAndBack
    {
        type empty;
    }
}
