runs/run_cht/cfd/rccs2d/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       23740;
    }
    riser
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       23940;
    }
    topAndBottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       24140;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          24000;
        startFace       24260;
    }
)

// ************************************************************************* //
