runs/run_cht/cfd/rccs2d/constant/radiationProperties
FoamFile { version 2.0; format ascii; class dictionary; object radiationProperties; }
radiation       on;
radiationModel  fvDOM;
fvDOMCoeffs
{
    nPhi        4;      // azimuthal (in 2D x-y plane)
    nTheta      3;      // polar
    tolerance   1e-3;
    maxIter     15;
}
solverFreq 3;
absorptionEmissionModel constantAbsorptionEmission;
constantAbsorptionEmissionCoeffs
{
    absorptivity absorptivity [ m^-1 ] 0.05;   // air ~ transparent -> surface-to-surface
    emissivity   emissivity   [ m^-1 ] 0.05;
    E            E [ kg m^-1 s^-3 ] 0;
}
scatterModel none;
sootModel    none;
