runs/run_cht/cfd/rccs2d/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

solvers
{
    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         DICGaussSeidel;
    }

    "(U|h|k|epsilon|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }

    "(G|Ii|ILambda.*)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-4;
        relTol          0.1;
    }
}

SIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p_rgh               1e-5;
        U               1e-5;
        h               1e-5;
        "(k|omega)"     1e-3;
    }
}

relaxationFactors
{
    fields
    {
        rho             1.0;
        p_rgh           0.3;
    }
    equations
    {
        U               0.2;
        h               0.03;
        "(k|omega)"     0.7;
        G               0.7;
        ILambda         0.7;
    }
}
